Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21E15A.xml
      <value-group name="SUPC_BOD12__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD12 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD12 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SUPC_BOD12__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1024" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2048" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4096" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8192" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16384" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32768" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV65536" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SUPC_VREG__SEL">
        <value name="LDO" caption="LDO selection" value="0x0"/>
        <value name="BUCK" caption="Buck selection" value="0x1"/>
        <value name="SCVREG" caption="Switched Cap selection" value="0x2"/>
      </value-group>
      <value-group name="SUPC_VREF__SEL">
        <value name="1V0" caption="1.0V voltage reference typical value" value="0x0"/>
        <value name="1V1" caption="1.1V voltage reference typical value" value="0x1"/>
        <value name="1V2" caption="1.2V voltage reference typical value" value="0x2"/>
        <value name="1V25" caption="1.25V voltage reference typical value" value="0x3"/>
        <value name="2V0" caption="2.0V voltage reference typical value" value="0x4"/>
        <value name="2V2" caption="2.2V voltage reference typical value" value="0x5"/>
        <value name="2V4" caption="2.4V voltage reference typical value" value="0x6"/>
        <value name="2V5" caption="2.5V voltage reference typical value" value="0x7"/>
      </value-group>
      <value-group name="SUPC_BBPS__CONF">
        <value name="NONE" caption="The backup domain is always supplied by main power" value="0x0"/>
        <value name="APWS" caption="The power switch is handled by the automatic power switch" value="0x1"/>
        <value name="FORCED" caption="The backup domain is always supplied by battery backup power" value="0x2"/>
        <value name="BOD33" caption="The power switch is handled by the BOD33" value="0x3"/>
      </value-group>
    </module>
    <module name="TAL" id="U2253" version="1.0.2" caption="Trigger Allocator">
      <register-group name="CTIS" size="0x2">
        <register name="CTICTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Cross-Trigger Interface n Control A">
          <bitfield name="ACTION" caption="Action when global break issued" mask="0x3" values="TAL_CTICTRLA__ACTION"/>
          <bitfield name="RESTART" caption="Action when global restart issued" mask="0x4"/>
        </register>
        <register name="CTIMASK" offset="0x1" rw="RW" size="1" initval="0x00" caption="Cross-Trigger Interface n Mask">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="PPP" caption="PPP Break Master" mask="0x2"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
      </register-group>
      <register-group name="TAL" caption="Trigger Allocator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="RSTCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Reset Control">
        </register>
        <register name="EXTCTRL" offset="0x5" rw="RW" size="1" initval="0x00" caption="External Break Control">
          <bitfield name="ENABLE" caption="Enable BRK Pin" mask="0x1"/>
          <bitfield name="INV" caption="Invert BRK Pin" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x6" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="BRKEI" caption="Break Input Event Enable" mask="0x1"/>
          <bitfield name="BRKEO" caption="Break Output Event Enable" mask="0x2"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="BRK" caption="Break Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="BRK" caption="Break Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="BRK" caption="Break" mask="0x1"/>
        </register>
        <register name="GLOBMASK" offset="0xB" rw="RW" size="1" initval="0x00" caption="Global Break Requests Mask">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="PPP" caption="PPP Break Master" mask="0x2"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="HALT" offset="0xC" rw="W" size="1" initval="0x00" caption="Debug Halt Request">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="PPP" caption="PPP Break Master" mask="0x2"/>
          <bitfield name="EVBRK" caption="Event Break Master" mask="0x40"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="RESTART" offset="0xD" rw="W" size="1" initval="0x00" caption="Debug Restart Request">
          <bitfield name="CM0P" caption="CM0P Break Master" mask="0x1"/>
          <bitfield name="PPP" caption="PPP Break Master" mask="0x2"/>
          <bitfield name="EXTBRK" caption="External Break Master" mask="0x80"/>
        </register>
        <register name="BRKSTATUS" offset="0xE" rw="R" size="2" initval="0x0000" caption="Break Request Status">
          <bitfield name="CM0P" caption="CM0P Break Request" mask="0x3"/>
          <bitfield name="PPP" caption="PPP Break Request" mask="0xC"/>
          <bitfield name="EVBRK" caption="Event Break Request" mask="0x3000"/>
          <bitfield name="EXTBRK" caption="External Break Request" mask="0xC000"/>
        </register>
        <register-group name="CTIS" name-in-module="CTIS" offset="0x10" count="4"/>
        <register name="INTSTATUS" offset="0x20" rw="R" size="1" count="29" initval="0x00" caption="Interrupt n Status">
          <bitfield name="IRQ0" caption="Interrupt Status for Interrupt Request 0 within Interrupt n" mask="0x1"/>
          <bitfield name="IRQ1" caption="Interrupt Status for Interrupt Request 1 within Interrupt n" mask="0x2"/>
          <bitfield name="IRQ2" caption="Interrupt Status for Interrupt Request 2 within Interrupt n" mask="0x4"/>
          <bitfield name="IRQ3" caption="Interrupt Status for Interrupt Request 3 within Interrupt n" mask="0x8"/>
          <bitfield name="IRQ4" caption="Interrupt Status for Interrupt Request 4 within Interrupt n" mask="0x10"/>
          <bitfield name="IRQ5" caption="Interrupt Status for Interrupt Request 5 within Interrupt n" mask="0x20"/>
          <bitfield name="IRQ6" caption="Interrupt Status for Interrupt Request 6 within Interrupt n" mask="0x40"/>
          <bitfield name="IRQ7" caption="Interrupt Status for Interrupt Request 7 within Interrupt n" mask="0x80"/>
        </register>
        <register name="DMACPUSEL0" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="DMA Channel Interrupts CPU Select 0">
          <bitfield name="CH0" caption="DMA Channel 0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CH1" caption="DMA Channel 1 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="CH2" caption="DMA Channel 2 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="CH3" caption="DMA Channel 3 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="CH4" caption="DMA Channel 4 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="CH5" caption="DMA Channel 5 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="CH6" caption="DMA Channel 6 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="CH7" caption="DMA Channel 7 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="CH8" caption="DMA Channel 8 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="CH9" caption="DMA Channel 9 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="CH10" caption="DMA Channel 10 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="CH11" caption="DMA Channel 11 Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="CH12" caption="DMA Channel 12 Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="CH13" caption="DMA Channel 13 Interrupt CPU Select" mask="0x4000000"/>
          <bitfield name="CH14" caption="DMA Channel 14 Interrupt CPU Select" mask="0x10000000"/>
          <bitfield name="CH15" caption="DMA Channel 15 Interrupt CPU Select" mask="0x40000000"/>
        </register>
